Конфигурация/Catalogs/ПаевыеИнвестиционныеФонды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ПаевыеИнвестиционныеФонды</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПифовВЗависимостиОтЛиквидности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КатегорииПИФовВЗависимостиОтОбъектаИнвестирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПравил</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПравил</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПрекращения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганВыдавшийЛицензию</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РегуляторыРынкаЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганУтвердившийПравила</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РегуляторыРынкаЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/InformationRegisters/НастройкиФормированияСЧА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>НастройкиФормированияСЧА</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПериодичностьРасчетаСЧА</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиРегламентныхДействий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьРасчетныйКупон</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НКДВСправедливойСтоимостиЦБ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантРасчетаПроцентовПоСделкамРЕПО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыРасчетаПроцентовПоСделкамРЕПО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТочностьРасчетнойСтавкиРЕПО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КритерийСущественностиОтклоненияССТПлюс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьНастройкиУчетнойПолитикиЕПС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодичностьНачисленияРезервов</Name>
					<Comment>#538027</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьПереоценкиАктивов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КорзинаОФЗПК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КорзиныОФЗПК</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПриостановленРасчетСЧА</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Catalogs/ПаевыеИнвестиционныеФонды/Ext/ManagerModule.bsl
// Если у ПИФа есть период приостановки операций с паями, возвращает структуру с датой начала и окончания этого периода.
// Иначе Неопределено
//
//	Параметры:
//		Субъект - счет доверительного управления ПИФ
//
Функция ПериодыПриостановкиОперацийСПаями(Субъект) Экспорт
	
	Если ТипЗнч(Субъект) = Тип("СправочникСсылка.СчетаДоверительногоУправления") Тогда
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВЫБОР
			|		КОГДА НастройкиФормированияСЧА.ПриостановленРасчетСЧА
			|			ТОГДА НастройкиФормированияСЧА.Период
			|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
			|	КОНЕЦ КАК ДатаНачала,
			|	ВЫБОР
			|		КОГДА НастройкиФормированияСЧА.ПриостановленРасчетСЧА
			|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
			|		ИНАЧЕ КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(НастройкиФормированияСЧА.Период, ДЕНЬ, -1), ДЕНЬ)
			|	КОНЕЦ КАК ДатаОкончания,
			|	НастройкиФормированияСЧА.ПриостановленРасчетСЧА КАК ПриостановленРасчетСЧА
			|ПОМЕСТИТЬ _ГраницыПриостановки
			|ИЗ
			|	РегистрСведений.НастройкиФормированияСЧА КАК НастройкиФормированияСЧА
			|ГДЕ
			|	НастройкиФормированияСЧА.СчетДоверительногоУправления = &СчетДоверительногоУправления
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	МАКСИМУМ(_ДатыНачалаПриостановки.ДатаНачала) КАК ДатаНачала,
			|	_ДатыОкончанияПриостановки.ДатаОкончания КАК ДатаОкончания
			|ИЗ
			|	_ГраницыПриостановки КАК _ДатыОкончанияПриостановки
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ГраницыПриостановки КАК _ДатыНачалаПриостановки
			|		ПО (_ДатыНачалаПриостановки.ДатаНачала <= _ДатыОкончанияПриостановки.ДатаОкончания
			|				ИЛИ _ДатыОкончанияПриостановки.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
			|			И (_ДатыНачалаПриостановки.ДатаНачала <> ДАТАВРЕМЯ(1, 1, 1))
			|			И (_ДатыНачалаПриостановки.ПриостановленРасчетСЧА)
			|ГДЕ
			|	_ДатыНачалаПриостановки.ДатаНачала ЕСТЬ НЕ NULL 
			|
			|СГРУППИРОВАТЬ ПО
			|	_ДатыОкончанияПриостановки.ДатаОкончания
			|
			|УПОРЯДОЧИТЬ ПО
			|	ДатаНачала";
		
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", Субъект);
		
		РезультатьЗапроса = Запрос.Выполнить();
		
		Возврат ?(РезультатьЗапроса.Пустой(), Неопределено, РезультатьЗапроса.Выгрузить());
		
	Иначе
		ВызватьИсключение "Не реализована проверка для субъекта с типом '" + ТипЗнч(Субъект) + "'";
	КонецЕсли;
	
КонецФункции

Функция ПриостановленРасчетСЧА(Субъект, Период) Экспорт

	ПериодыПриостановки = ПериодыПриостановкиОперацийСПаями(Субъект);
	
	Если ПериодыПриостановки = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПериодыПриостановки.ДатаНачала КАК ДатаНачала,
		|	ПериодыПриостановки.ДатаОкончания КАК ДатаОкончания
		|ПОМЕСТИТЬ _ПериодыПриостановки
		|ИЗ
		|	&ПериодыПриостановки КАК ПериодыПриостановки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПериодыПриостановки.ДатаНачала КАК ДатаНачала,
		|	_ПериодыПриостановки.ДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	_ПериодыПриостановки КАК _ПериодыПриостановки
		|ГДЕ
		|	&Период МЕЖДУ _ПериодыПриостановки.ДатаНачала И _ПериодыПриостановки.ДатаОкончания";
	
	Запрос.УстановитьПараметр("Период",					Период);
	Запрос.УстановитьПараметр("ПериодыПриостановки",	ПериодыПриостановки);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции
